<?php

$lang['required']			= 'Поле "%s" обязательно для заполнения.';
$lang['isset']				= 'Поле "%s" должно содержать значение.';
$lang['valid_email']		= 'Поле "%s" должно содержать корректный E-mail адрес.';
$lang['valid_emails']		= 'Поле "%s" должно содержать только корректные E-mail адреса.';
$lang['valid_url']			= 'Поле "%s" должно содержать корректный URL-адрес.';
$lang['valid_ip']			= 'Поле "%s" должно содержать корректый IP-адрес.';
$lang['min_length']			= 'Поле "%s" должно содержать не менее %s символов.';
$lang['max_length']			= 'Поле "%s" не должно содержать более %s символов.';
$lang['exact_length']		= 'Поле "%s" должно содержать %s символов.';
$lang['alpha']				= 'Поле "%s" может должно содержать только буквы';
$lang['alpha_numeric']		= 'Поле "%s" может содержать только буквы и цифры.';
$lang['alpha_dash']			= 'Поле "%s" может содержать только буквы, цифры, подчеркивания и тире.';
$lang['numeric']			= 'Поле "%s" должно содержать число.';
$lang['is_numeric']			= 'Поле "%s" должно содержать число.';
$lang['integer']			= 'Поле "%s" должно содержать целое число.';
$lang['regex_match']		= 'Поле "%s" содержит данные в неверном формате.';
$lang['matches']			= 'Поле "%s" не совпадает с полем %s.';
$lang['is_natural']			= 'Поле "%s" должно содержать положительное целое число.';
$lang['is_natural_no_zero']	= 'Поле "%s" должно содержать число больше нуля.';
$lang['decimal']			= 'Поле "%s" должно содержать десятичную дробь.';
$lang['less_than']			= 'Поле "%s" должно содержать число меньше %s.';
$lang['greater_than']		= 'Поле "%s" должно содержать число больше %s.';


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */